
# ======================================
# 1. Создание переменных и вывод значений
# ======================================
name = "Никита"
age = 26
height = 1.73

print("Имя:", name)
print("Возраст:", age, "лет")
print("Рост:", height)

# ======================================
# 2. Изменение значений переменных
# ======================================
x = 10
print(type(x))
x = 25.5
print(type(x))
x = "Python"
print(x)
print(type(x))

# ======================================
# 3. Копирование ссылок
# ======================================

a = 7
b = a
print(a)
print(b)
a = 10
print(b)
# когда указали b=a, b указывает на объект 7, а когда присвоили а = 10 это просто создало новый объект 10 и а стал на него ссылаться, а b так и остался ссылаться на старый объект 7

# ======================================
# 4. Каскадное присваивание
# ======================================

x = y = z = 100
print(x)
print(y)
print(z)
print(id(x)) #Одинаковые id
print(id(y))
print(id(z))

x,y,z = 100, 5,23.2
print(x)
print(y)
print(z)
print(id(x)) #разные id
print(id(y))
print(id(z))

# ======================================
# 5. Обмен значений переменных
# ======================================

a = 5
b = 10
a,b = b,a
print(a,b)

# ======================================
# 6. Работа с именами переменных
# ======================================

# True, print, if - будет ошибка. Зарезервированными имена нельзя использовать в переменных
import keyword
print(keyword.kwlist)

# ======================================
# 7. Использование функции type()
# ======================================
var1 = 42
var2 = 3.14
var3 = "Hello"
print(type(var1))
print(type(var2))
print(type(var3))
var1 = 'TEST'
print(type(var1))

# ======================================
# 8. Дополнительные задания
# ======================================

user_name = "Никита"
user_age = 26
user_height = 1.73
is_student = True
favorite_language = "Python"
переменная = 10
print(переменная) #Работает






























