# ++++++++++++++++++++++++++++++++++++++++++++++++
# Методы строк
# ++++++++++++++++++++++++++++++++++++++++++++++++
# ================================================
# 1. Работа с регистром
# ================================================
s = "Python для автоматизации"
print(s.upper())
print(s.lower())
# ================================================
# 2. Подсчет вхождений подстроки
# ================================================

msg = "абракадабра"
print(msg.count("ра"))
print(msg.count("а", 2))

# ================================================
# 3. Поиск подстроки
# ================================================
myStr = "абракадабра"
print(myStr.find('ка'))
print(myStr.rfind("а"))
print(myStr.find("xyz")) #Ошибки не будет. Выведет -1

# ================================================
# 4. Замена подстроки
# ================================================

text = "Я изучаю Java"
new_text = text.replace('Java','Python')
print(new_text.replace(" ", "") )

# ================================================
# 5. Проверка содержимого строки
# ================================================

str1 = "Python"
print(str1.isalpha())
str2 = "12345"
print(str2.isdigit())
str3 = "123abc"
print(str3.isdigit())

# ================================================
# 6. Дополнение строк
# ================================================

code = "42"
print(code.rjust(5, "0"))
print(new_text.ljust(10, "*"))

# ================================================
# 7. Разбиение строк
# ================================================
str1 = "яблоко, груша, банан"
print(str1.split())
language = "Python;Java;C++"
res = language.split(";")
print(res)

# ================================================
# 8. Объединение списка в строку
# ================================================

myList = ["Привет", "мир", "!"]
res = " ".join(myList)
print(res)
myList2 = ["apple", "banana", "cherry"]
res2 = ", ".join(myList2)
print(res2)
# ================================================
# 9. Удаление пробелов
# ================================================

str1 = " Python"
print(str1.lstrip())
str2 = "Python "
print(str2.rstrip())
str3 = " Python "
print(str3.strip())

# ================================================
# 10. Дополнительное задание
# ================================================
text = "программирование"

print(text.replace("п", 'П'))  #Этот вариант частично подходит под задачу, но если в слово добавить еще П, то оно тоже будет большим
print(text[0].upper()+text[1:])
print(text.count("р"))
print(text.index("и"))
print(text[::-1])

# ++++++++++++++++++++++++++++++++++++++++++++++++
# Спецсимволы
# ++++++++++++++++++++++++++++++++++++++++++++++++
# ================================================
# 1. Перевод строки
# ================================================

text = "Hello\nPython"
print(text) #"Python" перешел на новую строку потому что в строке используется спец.символ \n,который переносит текст после него

# ================================================
# 2. Горизонтальная табуляция
# ================================================
t = "Python\tAutomation"
print(t)#\t добавляет оступы точно также как при нажатии tab

# ================================================
# 3. Экранирование символов
# ================================================
path = "C:\new\test.txt"
print(path) #путь распечатался частично из-за слешей. Принял n и t за спец символы
path2 = "C:\\new\\test.txt"
print(path2)
# text = "Марка вина "Ягодка""
var1 = 'Марка вина "Ягодка"'
var2 = """"Марка вина "Ягодка"""""
var3 = "Марка вина \"Ягодка\""

print(var1)
print(var2)
print(var3)

# ================================================
# 4. Сырые (raw) строки
# ================================================

path = r"C:\new\test.txt"
print(path) #Разница в обработке спец.символов. В обычной строке спец.символы обрабатываются, а при r не обрабатываются.

# ================================================
# 5. Использование разных спецсимволов
# ================================================
s = "Hello\b World"#Обрезал последнюю букву у слова hello
print(s)
s = "Hello\fPython"
print(s)

# ================================================
# 6. Дополнительное задание
# ================================================
#
# ++++++++++++++++++++++++++++++++++++++++++++++++
# Форматирование строк
# ++++++++++++++++++++++++++++++++++++++++++++++++
# ================================================
# 1. Формирование строк через конкатенацию
# ================================================

name = 'Антон'
age = 35
print('Меня зовут ' + name + ', мне ' + str(age) +' лет.')

number = '233'
print(type(number)) #станет стринг вместо int
#Если имеется ввиду прибавить к строке число, то будет ошибка
# s = "Число: " + 5
# print(s)

# ================================================
# 2. Форматирование строк с .format()
# ================================================
name = "Антон"
age = 35
text1 = "Привет, меня зовут {name}, мне {age} лет.".format(name=name, age=age)
print(text1)

# Изменённый порядок
text2 = "Привет, меня зовут {name}, мне {age} лет.".format(age=age, name=name)
print(text2)
# ================================================
# 3. Использование F-строк
# ================================================
city = 'Москва'
year = 2025
print(f'Сегодня {city} год, и я живу в {year}.')
print(f'Через 5 лет будет {year + 5} год.')

# ================================================
# 4. Операции внутри F-строк
# ================================================
my_age = 35
name = 'Егор'
print(f'Дважды мой возраст: {my_age*2}, имя в верхнем регистре: {name.upper()}')

# ================================================
# 5. Дополнительное задание
# ================================================

text_new  ="Курс валют: {number1} доллар = {number2} рубля.".format(number1 = 1, number2 = 92.5)
print(text_new)
num1 = 7
str = f"Квадрат числа {num1} равен {num1**2}."
print(str)