# ++++++++++++++++++++++++++++++++++++++++++++++++
# "Числа и арифметические операции"
# ++++++++++++++++++++++++++++++++++++++++++++++++
# ================================================
# 1. Работа с целыми и вещественными числами
# ================================================

a = 8
b = 3
x = 2.5
y = -1.7
print(type(a))
print(type(b))
print(type(x))
print(type(y))

# ================================================
# 2. Основные арифметические операции
# ================================================

num1 = 10
num2 = 100

num1 + num2
num1 - num2
num1 * num2
num1 / num2
num1 // num2
num1 % num2
num1 ** num2

# ================================================
# 3. Особенности работы с делением
# ================================================
a = 10
b = 3
print(a / b)
print(a // b)
print(a % b)
a = -10
b = 3
print(a / b)
print(a // b)
print(a % b)
a = 10
b = -3
print(a / b)
print(a // b)
print(a % b)

# ================================================
# 4. Работа с приоритетом операторов
# ================================================
print(5 + 3 * 2) # первое умножение, потом сложение
print((5 + 3) * 2) # первое сложение в скобках,потом умножение
print(10 / 2 ** 2) # первое возведение в степень, потом деление

# ================================================
# 5. Использование сокращенных операторов
# ================================================

count = 10
count += 5
count -= 3
count *= 2
count /= 4
print(count)



# ++++++++++++++++++++++++++++++++++++++++++++++++
# "Строки в Python".
# ++++++++++++++++++++++++++++++++++++++++++++++++
# ================================================
# 1. Создание строк
# ================================================

s1 = "Python"
s2 = 'Программирование'
print(s1)
print(s2)

my_str = '''
Lorem ipsum dolor sit amet, consectetur adipiscing elit, 
sed do eiusmod tempor incididunt ut labore et dolore magna aliqua.
Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. 
Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. 
Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.
'''
print(my_str)

empty = ''
print(len(empty))

# ================================================
# 2. Конкатенация строк
# ================================================
first_name = "Иван"
last_name = "Петров"

full_name = first_name + ' ' + last_name
print(full_name)

# ================================================
# 3. Преобразование типов
# ================================================
s = "Возраст: "
age = 25
result = s + str(age)
print(result)

# ================================================
# 4. Дублирование строк
# ================================================
print("ха " * 5)
#print("ха " * 2.5)#typeError: can't multiply sequence by non-int of type 'float'

# ================================================
# 5. Длина строки
# ================================================
text = "Привет, мир!"
print(len(text))
text1 = ''
print(len(text1))

# ================================================
# 6. Проверка вхождения подстроки
# ================================================
sentence = "Я изучаю Python"
print("Python" in sentence)
print("Java" in sentence)

# ================================================
# 7. Сравнение строк
# ================================================
a = "apple"
b = "banana"

print(a==b)
print(a != b )
print(a<b)
print(a>b)
print(a<=b)
print(a>=b)

# ================================================
# 8. Код символов
# ================================================
print(ord('A'))
print(ord('a'))
print(ord('Я'))
