# ++++++++++++++++++++++++++++++++++++++++++++++++
# Задачи на input() и print()
# ++++++++++++++++++++++++++++++++++++++++++++++++

# ================================================
# 1. Простая работа с print()
# ================================================
print("Привет, мир!")
print(5, 10, 15)
print(10 + 25)

# ================================================
# 2. Использование параметров sep и end в print()
# ================================================

print(1, 2, 3, sep= "&")
print("Python", "лучший язык", end="")
# ================================================
# 3. Форматированный вывод с F-строками
# ================================================
x = 3.14
y = -8
print(f'\nКоординаты точки: x = {x}; y = {y}')

name = input("Введите ваше имя: ")
age = input("Введите ваш возраст: ")
print(f'Имя: {name}, Возраст: {age}')

# ================================================
# 4. Работа с input()
# ================================================

name = input("Введите ваше имя: ")
print(f"Привет, {name}!")

# ================================================
# 5. Преобразование типов
# ================================================

num1 = input("Введите любое число: ")
num2 = input("Введите любое число: ")
print(int(num1) + int(num2))
num3 = input("Введите целое число: ")
print(int(num3) ** 2)

# ++++++++++++++++++++++++++++++++++++++++++++++++
# Булевые значения
# ++++++++++++++++++++++++++++++++++++++++++++++++
# ================================================
# 1. Основы булевой логики
# ================================================

print(5 > 3)
print(10 < 2)
print(7 == 7)
print(6 != 8)
print(4 >= 4)
print(9 <= 3)
res = 8 > 12
print(type(res))

# ================================================
# 2. Проверка четности и кратности числа
# ================================================

x = 15
print(x % 2 == 0)
print(x // 5)
res = (x % 3 == 0) and (x % 5 == 0)
print(res)

# ================================================
# 3. Работа с логическими операторами (and, or, not)
# ================================================
y = 4.5
res = y >= 1 and y <= 10
print(res)
res2 = y >= 0 and y <= 5 or y >= 10 and y <= 15
print(res2)


# ================================================
# 4. Приоритет логических операций
# ================================================

print(True or False and False,'dd')
print(not False and True)
print(False or not True and True)
print(not (10 > 5 or 3 < 1))

# ================================================
# 5. Приведение типов к bool
# ================================================

print(bool(0)) #false
print(bool(-5)) #true
print(bool(3.14))#true
print(bool(""))#false
print(bool("Python"))#true
print(bool(" "))#true

# ================================================
# 6. Дополнительное задание
# ================================================

n = 20
print(n > 0)
print(n % 2 == 0)
print(n // 3 == 0)

# ++++++++++++++++++++++++++++++++++++++++++++++++
# Срезы строк
# ++++++++++++++++++++++++++++++++++++++++++++++++
# ================================================
# 1. Доступ к символам по индексу.
# ================================================

s = "Программирование"
print(s[0])
print(s[-1])
print(s[2],s[-2])

# ================================================
# 2. Обращение к символам с проверкой границ
# ================================================
#print(s[100])#Получим ошибку IndexError: string index out of range
print(len(s))# получаем 16, но это кол-во букв, а индекс начинает с 0, поэтому делаем - 1 и получаем 15
print(s[15])#выводим последний символ

# ================================================
# 3. Создание срезов
# ================================================

b = s[0:5]
print(b)
f = s[2:7]
print(f)
e = s[1::2]
print(e)
print(s[::-1])

# ================================================
# 4. Работа с шагом в срезах
# ================================================

print(s[::3])
print(s[::-2])
# ================================================
# 5. Проверка неизменяемости строк
# ================================================
#s[0] = "п"
print(s)# ошибка возникает потому что через индексы нельзя менять символы

s2 = 'Сорт'
print("П"+s2[1:])

# ================================================
# 6. Дополнительное задание
# ================================================
word = "abcdefgh"
print(word[2:5])
print(word[::-1])
print(word[1:-1:])


