# ++++++++++++++++++++++++++++++++++++++++++++++++
# Условный оператор
# ++++++++++++++++++++++++++++++++++++++++++++++++
# ===============================================
# 1. Проверка знака числа
# ===============================================

x = int(input("Введите число: "))
if x > 0:
    print("Число положительное")
elif x<0:
    print("Число отрицательное")
else:
    print("Число равно нулю")
# ===============================================
# 2. Проверка на четность
# ===============================================
x = int(input("Введите целое число: "))
if x % 2 == 0:
    print("Число четное")
else:
    print("Число нечетное")
# ===============================================
# 3. Определение диапазона
# ===============================================
x = int(input("Введите число: "))
if x>=1 and x<=10:
    print("Число в диапазоне")
else:
    print("Число вне диапазона")
# ===============================================
# 4. Перестановка двух чисел
# ===============================================
a = int(input("Введите число: "))
b = int(input("Введите число: "))
if a < b:
    a,b = b,a
print(a, b)

# ===============================================
# 5. Поиск минимума из двух чисел
# ===============================================
a = int(input("Введите число: "))
b = int(input("Введите число: "))
if a < b:
    print(a)
else:
    print(b)
# ===============================================
# 6. Проверка наличия элемента в списке
# ===============================================
marks = [3, 4, 5, 2, 5, 4]
if 2 in marks:
    print("Есть неудовлетворительная оценка")
else:
    print("Все оценки положительные")

# ===============================================
# 7. Проверка делимости
# ===============================================
x = int(input("Введите число: "))
if x % 3 == 0 and x % 5 == 0:
    print("Число делится на 3 и 5")
elif x % 3 == 0:
    print("Число делится только на 3")
elif x % 5 == 0:
    print("Число делится только на 5")
else:
    print("Число не делится на 3 и 5")

# ===============================================
# 8. Оператор in для проверки пароля
# ===============================================
password = input("Введите пароль: ")

if password == "admin123":
    print('Доступ разрешен')
else:
     print("Доступ запрещен")
# ===============================================
# 9. Калькулятор скидки
# ===============================================
amount = int(input("Введите сумму покупки: "))
if amount >= 5000:
    print('Ваша скидка составляет 10%')
    print(f'К оплате: {int(amount-(amount*10/100))}')
elif amount >= 1000:
    print('Ваша скидка составляет 5%')
    print(f'К оплате: {int(amount - (amount * 5 / 100))}')
else:
    print('Скидки нет')

# ===============================================
# 10. Определение високосного года
# ===============================================
year = int(input("Введите год: "))
if (year % 4 == 0 and year % 100 != 0) or year % 400 == 0:
    print("Год високосный")
else:
    print("Год не високосный")

# ++++++++++++++++++++++++++++++++++++++++++++++++
# Вложенные условия и elif
# ++++++++++++++++++++++++++++++++++++++++++++++++
# ===============================================
# 1. Проверка оценки
# ===============================================

num = int(input("Введите число от 1 до 5: "))
if num == 5:
    print("Отлично!")
elif num == 4:
    print("Хорошо")
elif num == 3:
    print("Удовлетворительно")
elif num == 2 or num == 1:
    print("Неудовлетворительно")
else:
    print("Некорректная оценка")

# ==============================================
# 2. Определение времени суток по часам
# ==============================================
time = int(input("Введите время в часах (0-23): "))

if time >=6 and time <= 11:
    print("Утро")
elif time >=12 and time <= 17:
    print("День")
elif time >= 18 and time <= 21:
    print("Вечер")
elif (time >= 22 and  time <= 5) or (time >= 0 and time <= 5) :
    print("Ночь")
else:
    print("Некорректное время")

# ==============================================
# 3. Классификация температуры
# ==============================================

t = int(input("Укажите температуру: "))
if t <= -10:
    print("Очень холодно")
elif t <= -10 or t <=0:
    print("Холодно")
elif t >= 1 and t <=10:
    print("Прохладно")
elif t >= 11 and t <=25:
    print("Тепло")
elif t > 25:
    print("Жарко")
else:
    print("Некорректная температура")

# ==============================================
# 4. Проверка года на високосность
# ==============================================

year = int(input("Введите год: "))

if year % 400 == 0:
    print("Год високосный")
elif year % 100 == 0:
    print("Год не високосный")
elif year % 4 == 0:
    print("Год високосный")
else:
    print("Год не високосный")
# ==============================================
# 5. Калькулятор двух чисел
# ==============================================

try:
    num1 = int(input("Введите 1 число: "))
    num2 = int(input("Введите 2 число: "))
    operation = input("Укажите операцию для этих чисел (+, -, *, /): ")
    if operation == '+':
        print(int(num1 + num2))
    elif operation == '-':
        print(int(num1 - num2))
    elif operation == '*':
        print(int(num1 * num2))
    elif operation == '/' :
        if num1==0:
            print("Ошибка: деление на ноль!")
        else:
            print(num1 / num2)
    else:
        print("Некорректная операция")
except ValueError:
    print("Ошибка: введено не число")

# ++++++++++++++++++++++++++++++++++++++++++++++++
# Тернарный оператор
# ++++++++++++++++++++++++++++++++++++++++++++++++
# ==============================================
# 1. Проверка четности числа
# ==============================================

int1 = int(input())
print('является четным')if int1 % 2 == 0 else print('является нечетным')

# ==============================================
# 2. Определение наибольшего числа
# ==============================================

num1 = int(input("Введите 1 число: "))
num2 = int(input("Введите 2 число: "))

print(num1 if num1 > num2  else num2)

# ==============================================
# 3. Проверка положительного или отрицательного числа
# ==============================================
num1 = int(input("Введите 1 число: "))

print('число положительное') if num1 > 0 else (print(f'Число{num1}') if num1 == 0 else print('число отрицательное'))

# ==============================================
# 4. Определение возраста для входа в клуб
# ==============================================
age = int(input("Введите свой возраст: "))
print("Вход разрешен") if age >= 18 else print("Вход запрещен")

# ==============================================
# 5. Определение скидки в магазине
# ==============================================
amount = int(input("Введите сумму покупки: "))
print('скидки нет') if amount <= 5000 else print(f'Ваша скидка составляет 10%. Итоговая сумма к оплате {int(amount-(amount*10/100))}')





